OpenDTEF-v1912/tutorials/lagrangian/simpleReactingParcelFoam/verticalChannel/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }
    front
    {
        type            symmetryPlane;
    }
    inletCentral
    {
        type            zeroGradient;
    }
    inletSides
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        p0              $internalField;
    }
    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
